1)У массивов естть какой-либо ограниченный размер, который нельзя изменять, а у листов размер задавать не нужно.
2)Абстрактный класс нужен для того чтобы потом от него наследовались схожие между собой дочерние классы. Он отличается от обычного класса тем, что нельзя создавать объекты абстрактного класса.
3)Интерфейс создает определенные методы, которые потом перенимают разные классы, при это переопределяя их.
4)Нет, можно наследоваться только от одного класса.
5)Да, можно имплементировать сколько угодно интерфейсов в одном классе.
